{
    "1": {
        "question": "How many studies are in cBioPortal?",
        "answer_text": {
            "text": "There are 492 studies available in cBioPortal."
        },
        "answer_instructions": {
            "brief": {
                "1": "Count the total number of studies in the database."
            },
            "detailed": {
                "1": "Count rows in 'cancer_study' table."
            }
        }
    },
    "2": {
        "question": "How many patients and samples are in the MSK-CHORD Study?",
        "answer_text": {
            "text": "There are 24950 patients and 25040 samples."
        },
        "answer_instructions": {
            "brief": {
                "1": "Identify the MSK-CHORD study.",
                "2": "Count the distinct number of patients and samples in the study."

            },
            "detailed": {
                "1": "Get 'cancer_study_identifier' from row in 'cancer_study' table where terms related to 'MSK-CHORD' are found in the columns 'name' or 'description'.",
                "2": "Join 'sample' table with 'patient' table on 'sample.patient_id' and 'patient.internal_id'.",
                "3": "From the table in step 2, filter rows where 'cancer_study_identifier' matches the value found in step 1. Count distinct 'patient_id' and 'sample_id' values to get the number of patients and samples."
            }
        }
    },
    "3": {
        "question": "How many primary samples are in the MSK-CHORD Study?",
        "answer_text": {
            "text": "There are 15928 primary samples."
        },
        "answer_instructions": {
            "brief": {
                "1": "Identify the MSK-CHORD study.",
                "2": "Count the number of samples that are marked as 'Primary'."
            },
            "detailed": {
                "1": "Get 'cancer_study_identifier' from row in 'cancer_study' table where terms related to 'MSK-CHORD' are found in the columns 'name' or 'description'.",
                "2": "In the 'sample' table, count the number of samples where 'cancer_study_identifier' matches the value found in step 1 and 'sample_type' is 'Primary'."
            }
        }
    },
    "4": {
        "question": "What treatment did most patients receive in the MSK-CHORD Study?",
        "answer_text": {
            "text": "Fluorouracil."
        },
        "answer_instructions": {
            "brief": {
                "1": "Identify the MSK-CHORD study.",
                "2": "Retrieve clinical events related to 'treatment'.",
                "3": "Group by treatment type.",
                "4": "Determine which treatment was administered to the largest number of patients."
            },
            "detailed": {
                "1": "Get 'cancer_study_identifier' from row in 'cancer_study' table where terms related to 'MSK-CHORD' are found in the columns 'name' or 'description'.",
                "2": "From the 'clinical_event_derived' table, get rows where 'cancer_study_identifier' matches the value found in step 1 and 'event_type' is 'TREATMENT'.",
                "3": "Group the results from step 2 by the values in one or more of the columns 'TREATMENT_TYPE', 'SUBTYPE', 'AGENT', or 'AGENT_CLASS'. Count the number of distinct 'patient_id' values for each group.",
                "4": "Identify the treatments with the highest count of distinct patients from step 3."
            }
        }
    },
    "5": {
        "question": "What are the top 5 most frequently mutated genes in the Osteosarcoma study from TARGET?",
        "answer_text": {
            "text": "TP53 22.4%; MUC16 11.2%; TTN 11.2%; ATRX 7.7%; DNAH9 7.0%"
        },
        "answer_instructions": {
            "brief": {
                "1": "Identify the TARGET Osteosarcoma study.",
                "2": "Retrieve mutation data for the study.",
                "3": "Count the number of mutated samples for each gene.",
                "4": "Calculate mutation frequency as a percentage of all samples with mutation data in the study.",
                "5": "Identify the five genes with the highest mutation frequencies."
            },
            "detailed": {
                "1": "Get 'cancer_study_identifier' from row in 'cancer_study' table where terms related to 'Osteosarcoma' and 'TARGET' are found in the columns 'name' or 'description'.",
                "2": "In the 'genomic_event_derived' table, find rows where 'cancer_study_identifier' matches the value found in step 1 and 'variant_type' is 'mutation'.",
                "3": "Group the results from step 2 by 'hugo_gene_symbol'. Count the number of distinct 'sample_unique_id' values for each gene.",
                "4": "Identify the five genes with the highest counts from step 3.",
                "5": "In the 'genomic_event_derived' table, find rows where 'cancer_study_identifier' matches the value found in step 1 and count unique 'sample_unique_id' values to obtain the total number of samples with mutation data in the study.",
                "6": "Calculate the mutation frequency for each of the top five genes by dividing the counts from step 4 by the total number of samples from step 5, and multiplying by 100 to get a percentage."
            }
        }
    },
    "6": {
        "question": "What fraction of patients were older than five when diagnosed according to the Pediatric Neuroblastoma study from TARGET?",
        "answer_text": {
            "text": "11.62%"
        },
        "answer_instructions": {
            "brief": {
                "1": "Identify the TARGET Pediatric Neuroblastoma study.",
                "2": "Find the clinical attributes related to patient age at diagnosis in the study.",
                "3": "Get the age at diagnosis for each patient in the study.",
                "4": "Count the number of patients older than five years at diagnosis.",
                "5": "Calculate the percentage of these patients relative to the total number of patients in the study."
            }
        }
    },
    "7": {
        "question": "What is the most frequent mutation in the TP53 gene in the TCGA breast cancer study?",
        "answer_text": {
            "text": "R175H in 5.95% of samples"
        },
        "answer_instructions": {
            "brief": {
                "1": "Identify the TCGA breast cancer study.",
                "2": "Retrieve mutation data for the TP53 gene.",
                "3": "Count the number of samples with each mutation, and identify the most frequent one.",
                "4": "Calculate the frequency of this mutation as a percentage of all samples with mutation data in the study."
            }
        }
    },
    "8": {
        "question": "How many patients have an EGFR amplification in the TCGA Lung Adenocarcinoma study?",
        "answer_text": {
            "text": "26 patients (4.6%) have an amplification in the EGFR gene"
        },
        "answer_instructions": {
            "brief": {
                "1": "Identify the TCGA lung adenocarcinoma study.",
                "2": "Retrieve samples with amplification data for EGFR.",
                "3": "Count the number of unique patient IDs associated with EGFR amplification.",
                "4": "Calculate the percentage of these patients relative to the total number of patients with genomic data in the study."
            }
        }
    },
    "9": {
        "question": "Which KRAS mutations are most common in colorectal cancer?",
        "answer_text": {
            "text": "G12D; G12V; G12C; G12A; G12S; G13D."
        },
        "answer_instructions": {
            "brief": {
                "1": "Retrieve studies related to colorectal cancer.",
                "2": "Get mutation data for the KRAS gene in these studies.",
                "3": "Count the number of samples with each mutation.",
                "4": "Identify the most common KRAS mutations."
            }
        }
    },
    "10": {
        "question": "What is the median survival time in the Osteosarcoma study from TARGET?",
        "answer_text": {
            "text": "Approximately 22 months"
        },
        "answer_instructions": {
            "brief": {
                "1": "Identify the TARGET Osteosarcoma study.",
                "2": "Find the clinical attributes related to survival months and status in the study.",
                "3": "Retrieve the survival months and status for each patient in the study.",
                "4": "Perform Kaplan-Meier analysis to determine the time at which survival drops below 50%."
            }
        }
    },
    "11": {
        "question": "How does methylation of the MGMT gene promoter affect the prognosis and treatment response in patients with glioblastoma?",
        "answer_text": {
            "text": "When the MGMT promoter is methylated cancer cells are vulnerable to temozolomide leading to a better prognosis"
        },
        "answer_instructions": {
            "brief": {
                "1": "Identify glioblastoma studies containing promoter methylation and treatment response data.",
                "2": "Retrieve data on MGMT promoter methylation status, treatment response, and survival outcomes.",
                "3": "Compare survival outcomes between patients with methylated and unmethylated MGMT promoters who received different treatments."
            }
        }
    },
    "12": {
        "question": "For patients with the EML4-ALK fusion gene in lung cancer how do the different fusion variants affect their long-term quality of life and risk of developing a secondary cancer?",
        "answer_text": {
            "text": "This question cannot be answered with the cBioPortal databse."
        },
        "answer_instructions": {
            "brief": {
                "0": "No queries can be constructed to answer this question with the cBioPortal database."
            }
        }
    },
    "13": {
        "question": "For the TCGA pan-cancer cohort what is the survival difference and the corresponding statistical significance between patients with mutations in both TP53 and KRAS versus patients with only a KRAS mutation?",
        "answer_text": {
            "text": "Patients with both TP53 and KRAS mutations had a median overall survival of approximately 22 months. While patients with only a KRAS mutation had a median overall survival that was not reached as none of them had died by the end of the study period. The log-rank test p-value is 0.0209 which indicates that the difference in overall survival between the two groups is statistically significant."
        },
        "answer_instructions": {
            "brief": {
                "1": "Identify the TCGA pan-cancer study.",
                "2": "Retrieve mutation data for TP53 and KRAS in the study.",
                "3": "Select patients with mutations in both TP53 and KRAS as well as those with only a KRAS mutation.",
                "4": "Find the clinical attributes related to survival months and status in the study.",
                "5": "Retrieve the survival months and status for both groups of patients defined in step 3.",
                "6": "Perform Kaplan-Meier survival analysis for both groups and calculate the log-rank test p-value to assess statistical significance."
            }
        }
    },
    "14": {
        "question": "Does Tylenol cause cancer?",
        "answer_text": {
            "text": "This question cannot be answered with the cBioPortal databse"
        },
        "answer_instructions": {
            "brief": {
                "0": "No queries can be constructed to answer this question with the cBioPortal database."
            }
        }
    },
    "15": {
        "question": "Are there studies that were not processed using polyA enrichment in order to explore lncRNA-related questions?",
        "answer_text": {
            "text": "Library preparation protocols are not contained in the database and should be consulted in the publications underlying the studies."
        },
        "answer_instructions": {
            "brief": {
                "0": "No queries can be constructed to answer this question with the cBioPortal database."
            }
        }
    },
    "16": {
        "question": "In the Breast Invasive Carcinoma TCGA study what are the top 5 down-regulated genes in TP53 mutated samples compared to non-mutated ones?",
        "answer_text": {
            "text": "AGR3; TFF1; SRARP; CYP2B7P; CPB1"
        },
        "answer_instructions": {
            "brief": {
                "1": "Identify the Breast Invasive Carcinoma TCGA study.",
                "2": "Retrieve gene expression data for TP53 mutated and non-mutated samples.",
                "3": "Compare the expression levels of all genes between the two groups.",
                "4": "Identify the top 5 down-regulated genes in TP53 mutated samples."
            }
        }
    }
}